remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/wdt.h
/**
 * \file
 *
 * \brief Component description for WDT
 *
 * Copyright (c) 2015-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMB11_WDT_COMPONENT_
#define _SAMB11_WDT_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR WDT */
/* ========================================================================== */
/** \addtogroup SAMB11_WDT Watchdog0 Timer 
 *  @{
 */

#ifndef COMPONENT_TYPEDEF_STYLE
  #define COMPONENT_TYPEDEF_STYLE 'N'  /**< Defines default style of typedefs for the component header files ('R' = RFO, 'N' = NTO*/
#endif

#define WDT_W1234
#define REV_WDT                          0x100

/* -------- WDT_WDOGLOAD : (WDT Offset: 0x00) (R/W 32) Watchdog Load Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t WDOGLOAD:32;               /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} WDT_WDOGLOAD_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define WDT_WDOGLOAD_OFFSET                 0x00                                          /**<  (WDT_WDOGLOAD) Watchdog Load Register  Offset */
#define WDT_WDOGLOAD_RESETVALUE             0xFFFFFFFFu                                   /**<  (WDT_WDOGLOAD) Watchdog Load Register  Reset Value */

#define WDT_WDOGLOAD_WDOGLOAD_Pos           0                                              /**< (WDT_WDOGLOAD)  Position */
#define WDT_WDOGLOAD_WDOGLOAD_Msk           (0xFFFFFFFFu << WDT_WDOGLOAD_WDOGLOAD_Pos)     /**< (WDT_WDOGLOAD)  Mask */
#define WDT_WDOGLOAD_WDOGLOAD(value)        (WDT_WDOGLOAD_WDOGLOAD_Msk & ((value) << WDT_WDOGLOAD_WDOGLOAD_Pos))
#define WDT_WDOGLOAD_MASK                   0xFFFFFFFFu                                    /**< \deprecated (WDT_WDOGLOAD) Register MASK  (Use WDT_WDOGLOAD_Msk instead)  */
#define WDT_WDOGLOAD_Msk                    0xFFFFFFFFu                                    /**< (WDT_WDOGLOAD) Register Mask  */

/* -------- WDT_WDOGVALUE : (WDT Offset: 0x04) (R/ 32) Watchdog Value Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t WDOGVALUE:32;              /**< bit:  0..31                                           */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} WDT_WDOGVALUE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define WDT_WDOGVALUE_OFFSET                0x04                                          /**<  (WDT_WDOGVALUE) Watchdog Value Register  Offset */
#define WDT_WDOGVALUE_RESETVALUE            0xFFFFFFFFu                                   /**<  (WDT_WDOGVALUE) Watchdog Value Register  Reset Value */

#define WDT_WDOGVALUE_WDOGVALUE_Pos         0                                              /**< (WDT_WDOGVALUE)  Position */
#define WDT_WDOGVALUE_WDOGVALUE_Msk         (0xFFFFFFFFu << WDT_WDOGVALUE_WDOGVALUE_Pos)   /**< (WDT_WDOGVALUE)  Mask */
#define WDT_WDOGVALUE_WDOGVALUE(value)      (WDT_WDOGVALUE_WDOGVALUE_Msk & ((value) << WDT_WDOGVALUE_WDOGVALUE_Pos))
#define WDT_WDOGVALUE_MASK                  0xFFFFFFFFu                                    /**< \deprecated (WDT_WDOGVALUE) Register MASK  (Use WDT_WDOGVALUE_Msk instead)  */
#define WDT_WDOGVALUE_Msk                   0xFFFFFFFFu                                    /**< (WDT_WDOGVALUE) Register Mask  */

/* -------- WDT_WDOGCONTROL : (WDT Offset: 0x08) (R/W 8) Watchdog Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  INTEN:1;                   /**< bit:      0  Active High Enable Interrupt Event       */
    uint8_t  RESEN:1;                   /**< bit:      1  Active High Enable Watchdog Reset Output */
    uint8_t  :6;                        /**< bit:   2..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} WDT_WDOGCONTROL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define WDT_WDOGCONTROL_OFFSET              0x08                                          /**<  (WDT_WDOGCONTROL) Watchdog Control Register  Offset */
#define WDT_WDOGCONTROL_RESETVALUE          0x00u                                         /**<  (WDT_WDOGCONTROL) Watchdog Control Register  Reset Value */

#define WDT_WDOGCONTROL_INTEN_Pos           0                                              /**< (WDT_WDOGCONTROL) Active High Enable Interrupt Event Position */
#define WDT_WDOGCONTROL_INTEN_Msk           (0x1u << WDT_WDOGCONTROL_INTEN_Pos)            /**< (WDT_WDOGCONTROL) Active High Enable Interrupt Event Mask */
#define WDT_WDOGCONTROL_INTEN               WDT_WDOGCONTROL_INTEN_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use WDT_WDOGCONTROL_INTEN_Msk instead */
#define WDT_WDOGCONTROL_RESEN_Pos           1                                              /**< (WDT_WDOGCONTROL) Active High Enable Watchdog Reset Output Position */
#define WDT_WDOGCONTROL_RESEN_Msk           (0x1u << WDT_WDOGCONTROL_RESEN_Pos)            /**< (WDT_WDOGCONTROL) Active High Enable Watchdog Reset Output Mask */
#define WDT_WDOGCONTROL_RESEN               WDT_WDOGCONTROL_RESEN_Msk                      /**< \deprecated Old style mask definition for 1 bit bitfield. Use WDT_WDOGCONTROL_RESEN_Msk instead */
#define WDT_WDOGCONTROL_MASK                0x03u                                          /**< \deprecated (WDT_WDOGCONTROL) Register MASK  (Use WDT_WDOGCONTROL_Msk instead)  */
#define WDT_WDOGCONTROL_Msk                 0x03u                                          /**< (WDT_WDOGCONTROL) Register Mask  */

