remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/wdt.h
/* -------- WDT_WDOGINTCLR : (WDT Offset: 0x0c) (/W 8) Watchdog Clear Interrupt Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  WDOGINTCLR:1;              /**< bit:      0                                           */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} WDT_WDOGINTCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define WDT_WDOGINTCLR_OFFSET               0x0C                                          /**<  (WDT_WDOGINTCLR) Watchdog Clear Interrupt Register  Offset */
#define WDT_WDOGINTCLR_RESETVALUE           0x00u                                         /**<  (WDT_WDOGINTCLR) Watchdog Clear Interrupt Register  Reset Value */

#define WDT_WDOGINTCLR_WDOGINTCLR_Pos       0                                              /**< (WDT_WDOGINTCLR)  Position */
#define WDT_WDOGINTCLR_WDOGINTCLR_Msk       (0x1u << WDT_WDOGINTCLR_WDOGINTCLR_Pos)        /**< (WDT_WDOGINTCLR)  Mask */
#define WDT_WDOGINTCLR_WDOGINTCLR           WDT_WDOGINTCLR_WDOGINTCLR_Msk                  /**< \deprecated Old style mask definition for 1 bit bitfield. Use WDT_WDOGINTCLR_WDOGINTCLR_Msk instead */
#define WDT_WDOGINTCLR_MASK                 0x01u                                          /**< \deprecated (WDT_WDOGINTCLR) Register MASK  (Use WDT_WDOGINTCLR_Msk instead)  */
#define WDT_WDOGINTCLR_Msk                  0x01u                                          /**< (WDT_WDOGINTCLR) Register Mask  */

/* -------- WDT_WDOGRIS : (WDT Offset: 0x10) (R/ 8) Watchdog Raw Interrupt Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  WDOGRIS:1;                 /**< bit:      0                                           */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} WDT_WDOGRIS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define WDT_WDOGRIS_OFFSET                  0x10                                          /**<  (WDT_WDOGRIS) Watchdog Raw Interrupt Status Register  Offset */
#define WDT_WDOGRIS_RESETVALUE              0x00u                                         /**<  (WDT_WDOGRIS) Watchdog Raw Interrupt Status Register  Reset Value */

#define WDT_WDOGRIS_WDOGRIS_Pos             0                                              /**< (WDT_WDOGRIS)  Position */
#define WDT_WDOGRIS_WDOGRIS_Msk             (0x1u << WDT_WDOGRIS_WDOGRIS_Pos)              /**< (WDT_WDOGRIS)  Mask */
#define WDT_WDOGRIS_WDOGRIS                 WDT_WDOGRIS_WDOGRIS_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use WDT_WDOGRIS_WDOGRIS_Msk instead */
#define WDT_WDOGRIS_MASK                    0x01u                                          /**< \deprecated (WDT_WDOGRIS) Register MASK  (Use WDT_WDOGRIS_Msk instead)  */
#define WDT_WDOGRIS_Msk                     0x01u                                          /**< (WDT_WDOGRIS) Register Mask  */

/* -------- WDT_WDOGMIS : (WDT Offset: 0x14) (R/ 8) Watchdog Interrupt Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  WDOGMIS:1;                 /**< bit:      0                                           */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} WDT_WDOGMIS_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define WDT_WDOGMIS_OFFSET                  0x14                                          /**<  (WDT_WDOGMIS) Watchdog Interrupt Status Register  Offset */
#define WDT_WDOGMIS_RESETVALUE              0x00u                                         /**<  (WDT_WDOGMIS) Watchdog Interrupt Status Register  Reset Value */

#define WDT_WDOGMIS_WDOGMIS_Pos             0                                              /**< (WDT_WDOGMIS)  Position */
#define WDT_WDOGMIS_WDOGMIS_Msk             (0x1u << WDT_WDOGMIS_WDOGMIS_Pos)              /**< (WDT_WDOGMIS)  Mask */
#define WDT_WDOGMIS_WDOGMIS                 WDT_WDOGMIS_WDOGMIS_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use WDT_WDOGMIS_WDOGMIS_Msk instead */
#define WDT_WDOGMIS_MASK                    0x01u                                          /**< \deprecated (WDT_WDOGMIS) Register MASK  (Use WDT_WDOGMIS_Msk instead)  */
#define WDT_WDOGMIS_Msk                     0x01u                                          /**< (WDT_WDOGMIS) Register Mask  */

/* -------- WDT_WDOGLOCK : (WDT Offset: 0xc00) (R/W 32) Watchdog Lock Register (Write 0x1ACCE551 to enable write access to all other registers) -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t ENABLE_STATUS:1;           /**< bit:      0  Read back of 1 indicates that write access is enabled */
    uint32_t ENABLE_REGISTER_WRITES:31;  /**< bit:  1..31  Read back all 0s, write 0x1ACCE551 to enable write access to all other registers */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} WDT_WDOGLOCK_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define WDT_WDOGLOCK_OFFSET                 0xC00                                         /**<  (WDT_WDOGLOCK) Watchdog Lock Register (Write 0x1ACCE551 to enable write access to all other registers)  Offset */
#define WDT_WDOGLOCK_RESETVALUE             0x00u                                         /**<  (WDT_WDOGLOCK) Watchdog Lock Register (Write 0x1ACCE551 to enable write access to all other registers)  Reset Value */

#define WDT_WDOGLOCK_ENABLE_STATUS_Pos      0                                              /**< (WDT_WDOGLOCK) Read back of 1 indicates that write access is enabled Position */
#define WDT_WDOGLOCK_ENABLE_STATUS_Msk      (0x1u << WDT_WDOGLOCK_ENABLE_STATUS_Pos)       /**< (WDT_WDOGLOCK) Read back of 1 indicates that write access is enabled Mask */
#define WDT_WDOGLOCK_ENABLE_STATUS          WDT_WDOGLOCK_ENABLE_STATUS_Msk                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use WDT_WDOGLOCK_ENABLE_STATUS_Msk instead */
#define WDT_WDOGLOCK_ENABLE_REGISTER_WRITES_Pos 1                                              /**< (WDT_WDOGLOCK) Read back all 0s, write 0x1ACCE551 to enable write access to all other registers Position */
#define WDT_WDOGLOCK_ENABLE_REGISTER_WRITES_Msk (0x7FFFFFFFu << WDT_WDOGLOCK_ENABLE_REGISTER_WRITES_Pos)  /**< (WDT_WDOGLOCK) Read back all 0s, write 0x1ACCE551 to enable write access to all other registers Mask */
#define WDT_WDOGLOCK_ENABLE_REGISTER_WRITES(value) (WDT_WDOGLOCK_ENABLE_REGISTER_WRITES_Msk & ((value) << WDT_WDOGLOCK_ENABLE_REGISTER_WRITES_Pos))
#define WDT_WDOGLOCK_MASK                   0xFFFFFFFFu                                    /**< \deprecated (WDT_WDOGLOCK) Register MASK  (Use WDT_WDOGLOCK_Msk instead)  */
#define WDT_WDOGLOCK_Msk                    0xFFFFFFFFu                                    /**< (WDT_WDOGLOCK) Register Mask  */

/* -------- WDT_WDOGITCR : (WDT Offset: 0xf00) (R/W 8) Watchdog Integration Test Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  ENABLE:1;                  /**< bit:      0  Set HIGH to place watchdog into integration test mode */
    uint8_t  :7;                        /**< bit:   1..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} WDT_WDOGITCR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define WDT_WDOGITCR_OFFSET                 0xF00                                         /**<  (WDT_WDOGITCR) Watchdog Integration Test Control Register  Offset */
#define WDT_WDOGITCR_RESETVALUE             0x00u                                         /**<  (WDT_WDOGITCR) Watchdog Integration Test Control Register  Reset Value */

#define WDT_WDOGITCR_ENABLE_Pos             0                                              /**< (WDT_WDOGITCR) Set HIGH to place watchdog into integration test mode Position */
#define WDT_WDOGITCR_ENABLE_Msk             (0x1u << WDT_WDOGITCR_ENABLE_Pos)              /**< (WDT_WDOGITCR) Set HIGH to place watchdog into integration test mode Mask */
#define WDT_WDOGITCR_ENABLE                 WDT_WDOGITCR_ENABLE_Msk                        /**< \deprecated Old style mask definition for 1 bit bitfield. Use WDT_WDOGITCR_ENABLE_Msk instead */
#define WDT_WDOGITCR_MASK                   0x01u                                          /**< \deprecated (WDT_WDOGITCR) Register MASK  (Use WDT_WDOGITCR_Msk instead)  */
#define WDT_WDOGITCR_Msk                    0x01u                                          /**< (WDT_WDOGITCR) Register Mask  */

/* -------- WDT_WDOGITOP : (WDT Offset: 0xf04) (R/W 8) Watchdog Integration Test Output Set Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  WDOGRES_VALUE:1;           /**< bit:      0  Value output on WDOGRES when in Integration Test Mode */
    uint8_t  WDOGINT_VALUE:1;           /**< bit:      1  Value output on WDOGINT when in Integration Test Mode */
    uint8_t  :6;                        /**< bit:   2..7  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} WDT_WDOGITOP_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define WDT_WDOGITOP_OFFSET                 0xF04                                         /**<  (WDT_WDOGITOP) Watchdog Integration Test Output Set Register  Offset */
#define WDT_WDOGITOP_RESETVALUE             0x00u                                         /**<  (WDT_WDOGITOP) Watchdog Integration Test Output Set Register  Reset Value */

#define WDT_WDOGITOP_WDOGRES_VALUE_Pos      0                                              /**< (WDT_WDOGITOP) Value output on WDOGRES when in Integration Test Mode Position */
#define WDT_WDOGITOP_WDOGRES_VALUE_Msk      (0x1u << WDT_WDOGITOP_WDOGRES_VALUE_Pos)       /**< (WDT_WDOGITOP) Value output on WDOGRES when in Integration Test Mode Mask */
#define WDT_WDOGITOP_WDOGRES_VALUE          WDT_WDOGITOP_WDOGRES_VALUE_Msk                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use WDT_WDOGITOP_WDOGRES_VALUE_Msk instead */
#define WDT_WDOGITOP_WDOGINT_VALUE_Pos      1                                              /**< (WDT_WDOGITOP) Value output on WDOGINT when in Integration Test Mode Position */
#define WDT_WDOGITOP_WDOGINT_VALUE_Msk      (0x1u << WDT_WDOGITOP_WDOGINT_VALUE_Pos)       /**< (WDT_WDOGITOP) Value output on WDOGINT when in Integration Test Mode Mask */
#define WDT_WDOGITOP_WDOGINT_VALUE          WDT_WDOGITOP_WDOGINT_VALUE_Msk                 /**< \deprecated Old style mask definition for 1 bit bitfield. Use WDT_WDOGITOP_WDOGINT_VALUE_Msk instead */
#define WDT_WDOGITOP_MASK                   0x03u                                          /**< \deprecated (WDT_WDOGITOP) Register MASK  (Use WDT_WDOGITOP_Msk instead)  */
#define WDT_WDOGITOP_Msk                    0x03u                                          /**< (WDT_WDOGITOP) Register Mask  */

