remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/wdt.h
/* -------- WDT_WDOGPERIPHID4 : (WDT Offset: 0xfd0) (R/ 8) Peripheral ID Register 4 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  JEP106_C_CODE:4;           /**< bit:   0..3  JEP106 C Code                            */
    uint8_t  BLOCK_COUNT:4;             /**< bit:   4..7  Block Count                              */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} WDT_WDOGPERIPHID4_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define WDT_WDOGPERIPHID4_OFFSET            0xFD0                                         /**<  (WDT_WDOGPERIPHID4) Peripheral ID Register 4  Offset */
#define WDT_WDOGPERIPHID4_RESETVALUE        0x04u                                         /**<  (WDT_WDOGPERIPHID4) Peripheral ID Register 4  Reset Value */

#define WDT_WDOGPERIPHID4_JEP106_C_CODE_Pos 0                                              /**< (WDT_WDOGPERIPHID4) JEP106 C Code Position */
#define WDT_WDOGPERIPHID4_JEP106_C_CODE_Msk (0xFu << WDT_WDOGPERIPHID4_JEP106_C_CODE_Pos)  /**< (WDT_WDOGPERIPHID4) JEP106 C Code Mask */
#define WDT_WDOGPERIPHID4_JEP106_C_CODE(value) (WDT_WDOGPERIPHID4_JEP106_C_CODE_Msk & ((value) << WDT_WDOGPERIPHID4_JEP106_C_CODE_Pos))
#define WDT_WDOGPERIPHID4_BLOCK_COUNT_Pos   4                                              /**< (WDT_WDOGPERIPHID4) Block Count Position */
#define WDT_WDOGPERIPHID4_BLOCK_COUNT_Msk   (0xFu << WDT_WDOGPERIPHID4_BLOCK_COUNT_Pos)    /**< (WDT_WDOGPERIPHID4) Block Count Mask */
#define WDT_WDOGPERIPHID4_BLOCK_COUNT(value) (WDT_WDOGPERIPHID4_BLOCK_COUNT_Msk & ((value) << WDT_WDOGPERIPHID4_BLOCK_COUNT_Pos))
#define WDT_WDOGPERIPHID4_MASK              0xFFu                                          /**< \deprecated (WDT_WDOGPERIPHID4) Register MASK  (Use WDT_WDOGPERIPHID4_Msk instead)  */
#define WDT_WDOGPERIPHID4_Msk               0xFFu                                          /**< (WDT_WDOGPERIPHID4) Register Mask  */

/* -------- WDT_WDOGPERIPHID5 : (WDT Offset: 0xfd4) (R/ 8) Peripheral ID Register 5 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  WDOGPERIPHID5:8;           /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} WDT_WDOGPERIPHID5_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define WDT_WDOGPERIPHID5_OFFSET            0xFD4                                         /**<  (WDT_WDOGPERIPHID5) Peripheral ID Register 5  Offset */
#define WDT_WDOGPERIPHID5_RESETVALUE        0x00u                                         /**<  (WDT_WDOGPERIPHID5) Peripheral ID Register 5  Reset Value */

#define WDT_WDOGPERIPHID5_WDOGPERIPHID5_Pos 0                                              /**< (WDT_WDOGPERIPHID5)  Position */
#define WDT_WDOGPERIPHID5_WDOGPERIPHID5_Msk (0xFFu << WDT_WDOGPERIPHID5_WDOGPERIPHID5_Pos)  /**< (WDT_WDOGPERIPHID5)  Mask */
#define WDT_WDOGPERIPHID5_WDOGPERIPHID5(value) (WDT_WDOGPERIPHID5_WDOGPERIPHID5_Msk & ((value) << WDT_WDOGPERIPHID5_WDOGPERIPHID5_Pos))
#define WDT_WDOGPERIPHID5_MASK              0xFFu                                          /**< \deprecated (WDT_WDOGPERIPHID5) Register MASK  (Use WDT_WDOGPERIPHID5_Msk instead)  */
#define WDT_WDOGPERIPHID5_Msk               0xFFu                                          /**< (WDT_WDOGPERIPHID5) Register Mask  */

/* -------- WDT_WDOGPERIPHID6 : (WDT Offset: 0xfd8) (R/ 8) Peripheral ID Register 6 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  WDOGPERIPHID6:8;           /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} WDT_WDOGPERIPHID6_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define WDT_WDOGPERIPHID6_OFFSET            0xFD8                                         /**<  (WDT_WDOGPERIPHID6) Peripheral ID Register 6  Offset */
#define WDT_WDOGPERIPHID6_RESETVALUE        0x00u                                         /**<  (WDT_WDOGPERIPHID6) Peripheral ID Register 6  Reset Value */

#define WDT_WDOGPERIPHID6_WDOGPERIPHID6_Pos 0                                              /**< (WDT_WDOGPERIPHID6)  Position */
#define WDT_WDOGPERIPHID6_WDOGPERIPHID6_Msk (0xFFu << WDT_WDOGPERIPHID6_WDOGPERIPHID6_Pos)  /**< (WDT_WDOGPERIPHID6)  Mask */
#define WDT_WDOGPERIPHID6_WDOGPERIPHID6(value) (WDT_WDOGPERIPHID6_WDOGPERIPHID6_Msk & ((value) << WDT_WDOGPERIPHID6_WDOGPERIPHID6_Pos))
#define WDT_WDOGPERIPHID6_MASK              0xFFu                                          /**< \deprecated (WDT_WDOGPERIPHID6) Register MASK  (Use WDT_WDOGPERIPHID6_Msk instead)  */
#define WDT_WDOGPERIPHID6_Msk               0xFFu                                          /**< (WDT_WDOGPERIPHID6) Register Mask  */

/* -------- WDT_WDOGPERIPHID7 : (WDT Offset: 0xfdc) (R/ 8) Peripheral ID Register 7 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  WDOGPERIPHID7:8;           /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} WDT_WDOGPERIPHID7_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define WDT_WDOGPERIPHID7_OFFSET            0xFDC                                         /**<  (WDT_WDOGPERIPHID7) Peripheral ID Register 7  Offset */
#define WDT_WDOGPERIPHID7_RESETVALUE        0x00u                                         /**<  (WDT_WDOGPERIPHID7) Peripheral ID Register 7  Reset Value */

