remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/wdt.h
#define WDT_WDOGPERIPHID7_WDOGPERIPHID7_Pos 0                                              /**< (WDT_WDOGPERIPHID7)  Position */
#define WDT_WDOGPERIPHID7_WDOGPERIPHID7_Msk (0xFFu << WDT_WDOGPERIPHID7_WDOGPERIPHID7_Pos)  /**< (WDT_WDOGPERIPHID7)  Mask */
#define WDT_WDOGPERIPHID7_WDOGPERIPHID7(value) (WDT_WDOGPERIPHID7_WDOGPERIPHID7_Msk & ((value) << WDT_WDOGPERIPHID7_WDOGPERIPHID7_Pos))
#define WDT_WDOGPERIPHID7_MASK              0xFFu                                          /**< \deprecated (WDT_WDOGPERIPHID7) Register MASK  (Use WDT_WDOGPERIPHID7_Msk instead)  */
#define WDT_WDOGPERIPHID7_Msk               0xFFu                                          /**< (WDT_WDOGPERIPHID7) Register Mask  */

/* -------- WDT_WDOGPERIPHID0 : (WDT Offset: 0xfe0) (R/ 8) Peripheral ID Register 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  PART_NUMBER:8;             /**< bit:   0..7  Part Number Bits 7:0                     */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} WDT_WDOGPERIPHID0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define WDT_WDOGPERIPHID0_OFFSET            0xFE0                                         /**<  (WDT_WDOGPERIPHID0) Peripheral ID Register 0  Offset */
#define WDT_WDOGPERIPHID0_RESETVALUE        0x24u                                         /**<  (WDT_WDOGPERIPHID0) Peripheral ID Register 0  Reset Value */

#define WDT_WDOGPERIPHID0_PART_NUMBER_Pos   0                                              /**< (WDT_WDOGPERIPHID0) Part Number Bits 7:0 Position */
#define WDT_WDOGPERIPHID0_PART_NUMBER_Msk   (0xFFu << WDT_WDOGPERIPHID0_PART_NUMBER_Pos)   /**< (WDT_WDOGPERIPHID0) Part Number Bits 7:0 Mask */
#define WDT_WDOGPERIPHID0_PART_NUMBER(value) (WDT_WDOGPERIPHID0_PART_NUMBER_Msk & ((value) << WDT_WDOGPERIPHID0_PART_NUMBER_Pos))
#define WDT_WDOGPERIPHID0_MASK              0xFFu                                          /**< \deprecated (WDT_WDOGPERIPHID0) Register MASK  (Use WDT_WDOGPERIPHID0_Msk instead)  */
#define WDT_WDOGPERIPHID0_Msk               0xFFu                                          /**< (WDT_WDOGPERIPHID0) Register Mask  */

/* -------- WDT_WDOGPERIPHID1 : (WDT Offset: 0xfe4) (R/ 8) Peripheral ID Register 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  PART_NUMBER:4;             /**< bit:   0..3  Part Number Bits 11:8                    */
    uint8_t  JEP106_ID_3_0:4;           /**< bit:   4..7  JEP106 ID Bits 3:0                       */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} WDT_WDOGPERIPHID1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define WDT_WDOGPERIPHID1_OFFSET            0xFE4                                         /**<  (WDT_WDOGPERIPHID1) Peripheral ID Register 1  Offset */
#define WDT_WDOGPERIPHID1_RESETVALUE        0xB8u                                         /**<  (WDT_WDOGPERIPHID1) Peripheral ID Register 1  Reset Value */

#define WDT_WDOGPERIPHID1_PART_NUMBER_Pos   0                                              /**< (WDT_WDOGPERIPHID1) Part Number Bits 11:8 Position */
#define WDT_WDOGPERIPHID1_PART_NUMBER_Msk   (0xFu << WDT_WDOGPERIPHID1_PART_NUMBER_Pos)    /**< (WDT_WDOGPERIPHID1) Part Number Bits 11:8 Mask */
#define WDT_WDOGPERIPHID1_PART_NUMBER(value) (WDT_WDOGPERIPHID1_PART_NUMBER_Msk & ((value) << WDT_WDOGPERIPHID1_PART_NUMBER_Pos))
#define WDT_WDOGPERIPHID1_JEP106_ID_3_0_Pos 4                                              /**< (WDT_WDOGPERIPHID1) JEP106 ID Bits 3:0 Position */
#define WDT_WDOGPERIPHID1_JEP106_ID_3_0_Msk (0xFu << WDT_WDOGPERIPHID1_JEP106_ID_3_0_Pos)  /**< (WDT_WDOGPERIPHID1) JEP106 ID Bits 3:0 Mask */
#define WDT_WDOGPERIPHID1_JEP106_ID_3_0(value) (WDT_WDOGPERIPHID1_JEP106_ID_3_0_Msk & ((value) << WDT_WDOGPERIPHID1_JEP106_ID_3_0_Pos))
#define WDT_WDOGPERIPHID1_MASK              0xFFu                                          /**< \deprecated (WDT_WDOGPERIPHID1) Register MASK  (Use WDT_WDOGPERIPHID1_Msk instead)  */
#define WDT_WDOGPERIPHID1_Msk               0xFFu                                          /**< (WDT_WDOGPERIPHID1) Register Mask  */

/* -------- WDT_WDOGPERIPHID2 : (WDT Offset: 0xfe8) (R/ 8) Peripheral ID Register 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  JEP106_ID_6_4:3;           /**< bit:   0..2  JEP106 ID Bits 6:4                       */
    uint8_t  JEDEC_USED:1;              /**< bit:      3  JEDEC Used                               */
    uint8_t  REVISION:4;                /**< bit:   4..7  Revision                                 */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} WDT_WDOGPERIPHID2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define WDT_WDOGPERIPHID2_OFFSET            0xFE8                                         /**<  (WDT_WDOGPERIPHID2) Peripheral ID Register 2  Offset */
#define WDT_WDOGPERIPHID2_RESETVALUE        0x1Bu                                         /**<  (WDT_WDOGPERIPHID2) Peripheral ID Register 2  Reset Value */

#define WDT_WDOGPERIPHID2_JEP106_ID_6_4_Pos 0                                              /**< (WDT_WDOGPERIPHID2) JEP106 ID Bits 6:4 Position */
#define WDT_WDOGPERIPHID2_JEP106_ID_6_4_Msk (0x7u << WDT_WDOGPERIPHID2_JEP106_ID_6_4_Pos)  /**< (WDT_WDOGPERIPHID2) JEP106 ID Bits 6:4 Mask */
#define WDT_WDOGPERIPHID2_JEP106_ID_6_4(value) (WDT_WDOGPERIPHID2_JEP106_ID_6_4_Msk & ((value) << WDT_WDOGPERIPHID2_JEP106_ID_6_4_Pos))
#define WDT_WDOGPERIPHID2_JEDEC_USED_Pos    3                                              /**< (WDT_WDOGPERIPHID2) JEDEC Used Position */
#define WDT_WDOGPERIPHID2_JEDEC_USED_Msk    (0x1u << WDT_WDOGPERIPHID2_JEDEC_USED_Pos)     /**< (WDT_WDOGPERIPHID2) JEDEC Used Mask */
#define WDT_WDOGPERIPHID2_JEDEC_USED        WDT_WDOGPERIPHID2_JEDEC_USED_Msk               /**< \deprecated Old style mask definition for 1 bit bitfield. Use WDT_WDOGPERIPHID2_JEDEC_USED_Msk instead */
#define WDT_WDOGPERIPHID2_REVISION_Pos      4                                              /**< (WDT_WDOGPERIPHID2) Revision Position */
#define WDT_WDOGPERIPHID2_REVISION_Msk      (0xFu << WDT_WDOGPERIPHID2_REVISION_Pos)       /**< (WDT_WDOGPERIPHID2) Revision Mask */
#define WDT_WDOGPERIPHID2_REVISION(value)   (WDT_WDOGPERIPHID2_REVISION_Msk & ((value) << WDT_WDOGPERIPHID2_REVISION_Pos))
#define WDT_WDOGPERIPHID2_MASK              0xFFu                                          /**< \deprecated (WDT_WDOGPERIPHID2) Register MASK  (Use WDT_WDOGPERIPHID2_Msk instead)  */
#define WDT_WDOGPERIPHID2_Msk               0xFFu                                          /**< (WDT_WDOGPERIPHID2) Register Mask  */

/* -------- WDT_WDOGPERIPHID3 : (WDT Offset: 0xfec) (R/ 8) Peripheral ID Register 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  CUSTOMER_MOD_NUMBER:4;     /**< bit:   0..3  Customer Modification Number             */
    uint8_t  ECO_REV_NUMBER:4;          /**< bit:   4..7  ECO Revision Number                      */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} WDT_WDOGPERIPHID3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define WDT_WDOGPERIPHID3_OFFSET            0xFEC                                         /**<  (WDT_WDOGPERIPHID3) Peripheral ID Register 3  Offset */
#define WDT_WDOGPERIPHID3_RESETVALUE        0x00u                                         /**<  (WDT_WDOGPERIPHID3) Peripheral ID Register 3  Reset Value */

