remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/wdt.h
#define WDT_WDOGPERIPHID3_CUSTOMER_MOD_NUMBER_Pos 0                                              /**< (WDT_WDOGPERIPHID3) Customer Modification Number Position */
#define WDT_WDOGPERIPHID3_CUSTOMER_MOD_NUMBER_Msk (0xFu << WDT_WDOGPERIPHID3_CUSTOMER_MOD_NUMBER_Pos)  /**< (WDT_WDOGPERIPHID3) Customer Modification Number Mask */
#define WDT_WDOGPERIPHID3_CUSTOMER_MOD_NUMBER(value) (WDT_WDOGPERIPHID3_CUSTOMER_MOD_NUMBER_Msk & ((value) << WDT_WDOGPERIPHID3_CUSTOMER_MOD_NUMBER_Pos))
#define WDT_WDOGPERIPHID3_ECO_REV_NUMBER_Pos 4                                              /**< (WDT_WDOGPERIPHID3) ECO Revision Number Position */
#define WDT_WDOGPERIPHID3_ECO_REV_NUMBER_Msk (0xFu << WDT_WDOGPERIPHID3_ECO_REV_NUMBER_Pos)  /**< (WDT_WDOGPERIPHID3) ECO Revision Number Mask */
#define WDT_WDOGPERIPHID3_ECO_REV_NUMBER(value) (WDT_WDOGPERIPHID3_ECO_REV_NUMBER_Msk & ((value) << WDT_WDOGPERIPHID3_ECO_REV_NUMBER_Pos))
#define WDT_WDOGPERIPHID3_MASK              0xFFu                                          /**< \deprecated (WDT_WDOGPERIPHID3) Register MASK  (Use WDT_WDOGPERIPHID3_Msk instead)  */
#define WDT_WDOGPERIPHID3_Msk               0xFFu                                          /**< (WDT_WDOGPERIPHID3) Register Mask  */

/* -------- WDT_WDOGPCELLID0 : (WDT Offset: 0xff0) (R/ 8) Component ID Register 0 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  WDOGPCELLID0:8;            /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} WDT_WDOGPCELLID0_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define WDT_WDOGPCELLID0_OFFSET             0xFF0                                         /**<  (WDT_WDOGPCELLID0) Component ID Register 0  Offset */
#define WDT_WDOGPCELLID0_RESETVALUE         0x0Du                                         /**<  (WDT_WDOGPCELLID0) Component ID Register 0  Reset Value */

#define WDT_WDOGPCELLID0_WDOGPCELLID0_Pos   0                                              /**< (WDT_WDOGPCELLID0)  Position */
#define WDT_WDOGPCELLID0_WDOGPCELLID0_Msk   (0xFFu << WDT_WDOGPCELLID0_WDOGPCELLID0_Pos)   /**< (WDT_WDOGPCELLID0)  Mask */
#define WDT_WDOGPCELLID0_WDOGPCELLID0(value) (WDT_WDOGPCELLID0_WDOGPCELLID0_Msk & ((value) << WDT_WDOGPCELLID0_WDOGPCELLID0_Pos))
#define WDT_WDOGPCELLID0_MASK               0xFFu                                          /**< \deprecated (WDT_WDOGPCELLID0) Register MASK  (Use WDT_WDOGPCELLID0_Msk instead)  */
#define WDT_WDOGPCELLID0_Msk                0xFFu                                          /**< (WDT_WDOGPCELLID0) Register Mask  */

/* -------- WDT_WDOGPCELLID1 : (WDT Offset: 0xff4) (R/ 8) Component ID Register 1 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  WDOGPCELLID1:8;            /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} WDT_WDOGPCELLID1_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define WDT_WDOGPCELLID1_OFFSET             0xFF4                                         /**<  (WDT_WDOGPCELLID1) Component ID Register 1  Offset */
#define WDT_WDOGPCELLID1_RESETVALUE         0xF0u                                         /**<  (WDT_WDOGPCELLID1) Component ID Register 1  Reset Value */

#define WDT_WDOGPCELLID1_WDOGPCELLID1_Pos   0                                              /**< (WDT_WDOGPCELLID1)  Position */
#define WDT_WDOGPCELLID1_WDOGPCELLID1_Msk   (0xFFu << WDT_WDOGPCELLID1_WDOGPCELLID1_Pos)   /**< (WDT_WDOGPCELLID1)  Mask */
#define WDT_WDOGPCELLID1_WDOGPCELLID1(value) (WDT_WDOGPCELLID1_WDOGPCELLID1_Msk & ((value) << WDT_WDOGPCELLID1_WDOGPCELLID1_Pos))
#define WDT_WDOGPCELLID1_MASK               0xFFu                                          /**< \deprecated (WDT_WDOGPCELLID1) Register MASK  (Use WDT_WDOGPCELLID1_Msk instead)  */
#define WDT_WDOGPCELLID1_Msk                0xFFu                                          /**< (WDT_WDOGPCELLID1) Register Mask  */

/* -------- WDT_WDOGPCELLID2 : (WDT Offset: 0xff8) (R/ 8) Component ID Register 2 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  WDOGPCELLID2:8;            /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} WDT_WDOGPCELLID2_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define WDT_WDOGPCELLID2_OFFSET             0xFF8                                         /**<  (WDT_WDOGPCELLID2) Component ID Register 2  Offset */
#define WDT_WDOGPCELLID2_RESETVALUE         0x05u                                         /**<  (WDT_WDOGPCELLID2) Component ID Register 2  Reset Value */

#define WDT_WDOGPCELLID2_WDOGPCELLID2_Pos   0                                              /**< (WDT_WDOGPCELLID2)  Position */
#define WDT_WDOGPCELLID2_WDOGPCELLID2_Msk   (0xFFu << WDT_WDOGPCELLID2_WDOGPCELLID2_Pos)   /**< (WDT_WDOGPCELLID2)  Mask */
#define WDT_WDOGPCELLID2_WDOGPCELLID2(value) (WDT_WDOGPCELLID2_WDOGPCELLID2_Msk & ((value) << WDT_WDOGPCELLID2_WDOGPCELLID2_Pos))
#define WDT_WDOGPCELLID2_MASK               0xFFu                                          /**< \deprecated (WDT_WDOGPCELLID2) Register MASK  (Use WDT_WDOGPCELLID2_Msk instead)  */
#define WDT_WDOGPCELLID2_Msk                0xFFu                                          /**< (WDT_WDOGPCELLID2) Register Mask  */

/* -------- WDT_WDOGPCELLID3 : (WDT Offset: 0xffc) (R/ 8) Component ID Register 3 -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint8_t  WDOGPCELLID3:8;            /**< bit:   0..7                                           */
  } bit;                                /**< Structure used for bit  access */
  uint8_t  reg;                         /**< Type used for register access */
} WDT_WDOGPCELLID3_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define WDT_WDOGPCELLID3_OFFSET             0xFFC                                         /**<  (WDT_WDOGPCELLID3) Component ID Register 3  Offset */
#define WDT_WDOGPCELLID3_RESETVALUE         0xB1u                                         /**<  (WDT_WDOGPCELLID3) Component ID Register 3  Reset Value */

#define WDT_WDOGPCELLID3_WDOGPCELLID3_Pos   0                                              /**< (WDT_WDOGPCELLID3)  Position */
#define WDT_WDOGPCELLID3_WDOGPCELLID3_Msk   (0xFFu << WDT_WDOGPCELLID3_WDOGPCELLID3_Pos)   /**< (WDT_WDOGPCELLID3)  Mask */
#define WDT_WDOGPCELLID3_WDOGPCELLID3(value) (WDT_WDOGPCELLID3_WDOGPCELLID3_Msk & ((value) << WDT_WDOGPCELLID3_WDOGPCELLID3_Pos))
#define WDT_WDOGPCELLID3_MASK               0xFFu                                          /**< \deprecated (WDT_WDOGPCELLID3) Register MASK  (Use WDT_WDOGPCELLID3_Msk instead)  */
#define WDT_WDOGPCELLID3_Msk                0xFFu                                          /**< (WDT_WDOGPCELLID3) Register Mask  */

#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'R'
/** \brief WDT hardware registers */
typedef struct {  /* Watchdog0 Timer */
  RwReg   WDOGLOAD;       /**< (WDT Offset: 0x00) Watchdog Load Register */
  RoReg   WDOGVALUE;      /**< (WDT Offset: 0x04) Watchdog Value Register */
  RwReg8  WDOGCONTROL;    /**< (WDT Offset: 0x08) Watchdog Control Register */
  __I  uint8_t  Reserved1[3];
  WoReg8  WDOGINTCLR;     /**< (WDT Offset: 0x0C) Watchdog Clear Interrupt Register */
  __I  uint8_t  Reserved2[3];
  RoReg8  WDOGRIS;        /**< (WDT Offset: 0x10) Watchdog Raw Interrupt Status Register */
  __I  uint8_t  Reserved3[3];
  RoReg8  WDOGMIS;        /**< (WDT Offset: 0x14) Watchdog Interrupt Status Register */
  __I  uint8_t  Reserved4[3051];
  RwReg   WDOGLOCK;       /**< (WDT Offset: 0xC00) Watchdog Lock Register (Write 0x1ACCE551 to enable write access to all other registers) */
  __I  uint32_t Reserved5[191];
  RwReg8  WDOGITCR;       /**< (WDT Offset: 0xF00) Watchdog Integration Test Control Register */
  __I  uint8_t  Reserved6[3];
  RwReg8  WDOGITOP;       /**< (WDT Offset: 0xF04) Watchdog Integration Test Output Set Register */
  __I  uint8_t  Reserved7[203];
  RoReg8  WDOGPERIPHID4;  /**< (WDT Offset: 0xFD0) Peripheral ID Register 4 */
  __I  uint8_t  Reserved8[3];
  RoReg8  WDOGPERIPHID5;  /**< (WDT Offset: 0xFD4) Peripheral ID Register 5 */
  __I  uint8_t  Reserved9[3];
  RoReg8  WDOGPERIPHID6;  /**< (WDT Offset: 0xFD8) Peripheral ID Register 6 */
  __I  uint8_t  Reserved10[3];
  RoReg8  WDOGPERIPHID7;  /**< (WDT Offset: 0xFDC) Peripheral ID Register 7 */
  __I  uint8_t  Reserved11[3];
  RoReg8  WDOGPERIPHID0;  /**< (WDT Offset: 0xFE0) Peripheral ID Register 0 */
  __I  uint8_t  Reserved12[3];
  RoReg8  WDOGPERIPHID1;  /**< (WDT Offset: 0xFE4) Peripheral ID Register 1 */
  __I  uint8_t  Reserved13[3];
  RoReg8  WDOGPERIPHID2;  /**< (WDT Offset: 0xFE8) Peripheral ID Register 2 */
  __I  uint8_t  Reserved14[3];
  RoReg8  WDOGPERIPHID3;  /**< (WDT Offset: 0xFEC) Peripheral ID Register 3 */
  __I  uint8_t  Reserved15[3];
  RoReg8  WDOGPCELLID0;   /**< (WDT Offset: 0xFF0) Component ID Register 0 */
  __I  uint8_t  Reserved16[3];
  RoReg8  WDOGPCELLID1;   /**< (WDT Offset: 0xFF4) Component ID Register 1 */
  __I  uint8_t  Reserved17[3];
  RoReg8  WDOGPCELLID2;   /**< (WDT Offset: 0xFF8) Component ID Register 2 */
  __I  uint8_t  Reserved18[3];
  RoReg8  WDOGPCELLID3;   /**< (WDT Offset: 0xFFC) Component ID Register 3 */
} Wdt;

