remotemcu/remcu-chip-sdks/Atmel/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/component/wdt.h
#elif COMPONENT_TYPEDEF_STYLE == 'N'
/** \brief WDT hardware registers */
typedef struct {  /* Watchdog0 Timer */
  __IO WDT_WDOGLOAD_Type              WDOGLOAD;       /**< Offset: 0x00 (R/W  32) Watchdog Load Register */
  __I  WDT_WDOGVALUE_Type             WDOGVALUE;      /**< Offset: 0x04 (R/   32) Watchdog Value Register */
  __IO WDT_WDOGCONTROL_Type           WDOGCONTROL;    /**< Offset: 0x08 (R/W   8) Watchdog Control Register */
       RoReg8                         Reserved1[0x3];
  __O  WDT_WDOGINTCLR_Type            WDOGINTCLR;     /**< Offset: 0x0C ( /W   8) Watchdog Clear Interrupt Register */
       RoReg8                         Reserved2[0x3];
  __I  WDT_WDOGRIS_Type               WDOGRIS;        /**< Offset: 0x10 (R/    8) Watchdog Raw Interrupt Status Register */
       RoReg8                         Reserved3[0x3];
  __I  WDT_WDOGMIS_Type               WDOGMIS;        /**< Offset: 0x14 (R/    8) Watchdog Interrupt Status Register */
       RoReg8                         Reserved4[0xBEB];
  __IO WDT_WDOGLOCK_Type              WDOGLOCK;       /**< Offset: 0xC00 (R/W  32) Watchdog Lock Register (Write 0x1ACCE551 to enable write access to all other registers) */
       RoReg8                         Reserved5[0x2FC];
  __IO WDT_WDOGITCR_Type              WDOGITCR;       /**< Offset: 0xF00 (R/W   8) Watchdog Integration Test Control Register */
       RoReg8                         Reserved6[0x3];
  __IO WDT_WDOGITOP_Type              WDOGITOP;       /**< Offset: 0xF04 (R/W   8) Watchdog Integration Test Output Set Register */
       RoReg8                         Reserved7[0xCB];
  __I  WDT_WDOGPERIPHID4_Type         WDOGPERIPHID4;  /**< Offset: 0xFD0 (R/    8) Peripheral ID Register 4 */
       RoReg8                         Reserved8[0x3];
  __I  WDT_WDOGPERIPHID5_Type         WDOGPERIPHID5;  /**< Offset: 0xFD4 (R/    8) Peripheral ID Register 5 */
       RoReg8                         Reserved9[0x3];
  __I  WDT_WDOGPERIPHID6_Type         WDOGPERIPHID6;  /**< Offset: 0xFD8 (R/    8) Peripheral ID Register 6 */
       RoReg8                         Reserved10[0x3];
  __I  WDT_WDOGPERIPHID7_Type         WDOGPERIPHID7;  /**< Offset: 0xFDC (R/    8) Peripheral ID Register 7 */
       RoReg8                         Reserved11[0x3];
  __I  WDT_WDOGPERIPHID0_Type         WDOGPERIPHID0;  /**< Offset: 0xFE0 (R/    8) Peripheral ID Register 0 */
       RoReg8                         Reserved12[0x3];
  __I  WDT_WDOGPERIPHID1_Type         WDOGPERIPHID1;  /**< Offset: 0xFE4 (R/    8) Peripheral ID Register 1 */
       RoReg8                         Reserved13[0x3];
  __I  WDT_WDOGPERIPHID2_Type         WDOGPERIPHID2;  /**< Offset: 0xFE8 (R/    8) Peripheral ID Register 2 */
       RoReg8                         Reserved14[0x3];
  __I  WDT_WDOGPERIPHID3_Type         WDOGPERIPHID3;  /**< Offset: 0xFEC (R/    8) Peripheral ID Register 3 */
       RoReg8                         Reserved15[0x3];
  __I  WDT_WDOGPCELLID0_Type          WDOGPCELLID0;   /**< Offset: 0xFF0 (R/    8) Component ID Register 0 */
       RoReg8                         Reserved16[0x3];
  __I  WDT_WDOGPCELLID1_Type          WDOGPCELLID1;   /**< Offset: 0xFF4 (R/    8) Component ID Register 1 */
       RoReg8                         Reserved17[0x3];
  __I  WDT_WDOGPCELLID2_Type          WDOGPCELLID2;   /**< Offset: 0xFF8 (R/    8) Component ID Register 2 */
       RoReg8                         Reserved18[0x3];
  __I  WDT_WDOGPCELLID3_Type          WDOGPCELLID3;   /**< Offset: 0xFFC (R/    8) Component ID Register 3 */
} Wdt;

#else /* COMPONENT_TYPEDEF_STYLE */
#error Unknown component typedef style
#endif /* COMPONENT_TYPEDEF_STYLE */

#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** @}*/


#endif /* _SAMB11_WDT_COMPONENT_ */
